nbd_fio_results/dev-nbd0_2023-07-17_12:43/rand_w_nbd0_4iodepth_1threads/2048.txt
rand-write: (g=0): rw=randwrite, bs=(R) 2048KiB-2048KiB, (W) 2048KiB-2048KiB, (T) 2048KiB-2048KiB, ioengine=libaio, iodepth=4
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nbd0 failed: Permission denied

rand-write: (groupid=0, jobs=1): err= 0: pid=17199: Mon Jul 17 12:47:35 2023
  write: IOPS=756, BW=1513MiB/s (1586MB/s)(29.5GiB/20004msec)
    slat (usec): min=47, max=1401, avg=740.18, stdev=147.98
    clat (usec): min=2426, max=7801, avg=4527.44, stdev=484.06
     lat (usec): min=3341, max=8290, avg=5285.31, stdev=452.19
    clat percentiles (usec):
     |  1.00th=[ 3392],  5.00th=[ 3687], 10.00th=[ 3884], 20.00th=[ 4146],
     | 30.00th=[ 4293], 40.00th=[ 4424], 50.00th=[ 4555], 60.00th=[ 4686],
     | 70.00th=[ 4817], 80.00th=[ 4883], 90.00th=[ 5014], 95.00th=[ 5145],
     | 99.00th=[ 5735], 99.50th=[ 6063], 99.90th=[ 6652], 99.95th=[ 6915],
     | 99.99th=[ 7308]
   bw (  MiB/s): min= 1424, max= 1688, per=100.00%, avg=1512.53, stdev=74.87, samples=40
   iops        : min=  712, max=  844, avg=756.25, stdev=37.45, samples=40
  lat (msec)   : 4=14.29%, 10=85.71%
  cpu          : usr=3.07%, sys=5.49%, ctx=251194, majf=0, minf=545
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,15129,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=1513MiB/s (1586MB/s), 1513MiB/s-1513MiB/s (1586MB/s-1586MB/s), io=29.5GiB (31.7GB), run=20004-20004msec

Disk stats (read/write):
  nbd0: ios=0/240565, merge=0/0, ticks=0/1029273, in_queue=1007249, util=99.86%